backend-desafio32/perf-test/artillery_result_fork.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 15:59:52(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 15:59:53(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 15:59:55(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 500/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 30
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 14.8
  max: ......................................................................... 110
  median: ...................................................................... 16.6
  p95: ......................................................................... 63.4
  p99: ......................................................................... 92.8