backend-desafio32/perf-test/artillery_result_fork_console_log.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:04:03(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:04:04(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 16:04:06(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 378/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 53
  median: ...................................................................... 19.1
  p95: ......................................................................... 30.9
  p99: ......................................................................... 37
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 162.4
  max: ......................................................................... 532.3
  median: ...................................................................... 424.2
  p95: ......................................................................... 528.6
  p99: ......................................................................... 528.6