backend-desafio32/perf-test/artillery_result_inspect.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:38:45(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:38:46(-0300)

All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 16:38:48(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 500/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 11
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15.5
  max: ......................................................................... 76.6
  median: ...................................................................... 19.5
  p95: ......................................................................... 49.9
  p99: ......................................................................... 56.3