backend-desafio32/perf-test/artillery_result_inspect_console.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 16:45:56(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 16:45:57(-0300)

All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 16:46:04(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 219/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 162
  median: ...................................................................... 68.7
  p95: ......................................................................... 96.6
  p99: ......................................................................... 113.3
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 341.3
  max: ......................................................................... 1596.9
  median: ...................................................................... 1436.8
  p95: ......................................................................... 1587.9
  p99: ......................................................................... 1587.9